<?php
if (! defined ( 'IN_KKFRAME' ))	exit ();
function get_random_content(){
	$text=<<<EOF
有的人认为坚持会让我们变得更强大，但有时候放手也会。
你若想要得到，就别只是期望。人生短暂，经不起等待。
如果觉得生活是一种刁难，一开始就输了。如果觉得刁难是一种雕刻，迟早都会赢的。
你不可能经由一个没有喜悦的旅程，而达到一个喜悦的终点。不管此刻，你追求的是什么，希望你能在过程中保持一颗喜悦的心，那么你所向往的东西，就会更不费力地来到你的生命中。
为了爱，失恋是必要的；为了光明，黑暗是必要的。
好夫妻的十大经典表现：恋爱时，彼此是崇拜者；交谈时，彼此是知音；得意时，彼此是吹牛对象；生气时，彼此是出气筒；困难时，彼此是咨询师；痛苦时，彼此是安慰者；病时，彼此是护理；老时，彼此是拐杖；平时，彼此各干各，保持适度距离。
你超过别人一点点，别人会嫉妒你；当你超过别人一大截，别人就会羡慕你。
当你了解人性，你也许就能够原谅所有的自私和软弱、所有的谎言与背叛。弗洛依德说，人的内心，既求生，也求死。我们追逐光明，却也追逐黑暗，我们那么想要得到爱，有时候却又近乎自毁地浪掷手中的爱……人心中似乎一直也有一片荒芜的夜地，留给那个寂寞也幽暗的自我。——杨澜
有些事，我们总是弄不懂；有些人，我们总是猜不透；有些道，我们总是悟不尽；有些理，我们总是想不通；有些坎，我们总是跨不过；有些伤，我们总是治不好；有些天，我们总是睡不着；有些情，我们总是说不出；有些爱，我们总是得不到。对不起，那些回不去的曾经。
为什么我们总是不懂得珍惜眼前人？在未可预知的重逢里，我们以为总会重逢，总会有缘再会，总以为有机会说一声对不起，却从没想过每一次挥手道别，都可能是诀别，每一声叹息，都可能是人间最后的一声叹息。
勇敢，那是一个人年轻时唯一拥有的东西。在一次次的错误中成长，将所有看似错误的选择最终引导向正确的结果。我坚信，人应该有力量，揪着自己的头发把自己从泥地里拔起来。——廖一梅《像我这样笨拙地生活》
忘掉岁月，忘掉痛苦，忘掉你的坏，我们永不永不说再见。
当你打算放弃梦想时，告诉自己再多撑一天、一个星期、一个月，再多撑一年吧。你会发现，拒绝退场的结果令人惊讶。
有时候你习惯了我的某个样子，当我变成另外一个样子的时候，你会觉得我变了，不再是之前的我了。其实，那只是你还不够了解我罢了。
你还是一个人，偶尔会孤单偶尔会难受会想有个人拥抱，所以你还是在等。没关系，你一定会等到的。你一定要相信，那个人也在经历了很多之后在找你。你要做的，就是好好照顾自己，让自己在最好的状态里，遇到最好的他。
暧昧，如同度的水，将沸未沸，发着低烧，表外波澜不惊，内部却暗流汹涌。友情以上，恋人未满的状态，在一段时期内，或许会带来模糊朦胧的美感，但是似浓似淡，时好时坏，患得患失的无望爱情，久了，相互喂养的蜜糖就可能变成有害身心健康的砒霜。
忘记那个人，不如忘记自己。告诉自己，不是怕他忘记，而是怕他有一天重新把你想起。岁月带走的是记忆，但回忆会越来越清晰。真的有一天，他回过头来告诉你，他一直在惦记你，千万不要相信，因为，他已经不是原来的他，而你，也不再是过去的你。
时间回不到开始的地方：对于已经错过的一些东西，或许不用再试着去挽留，错了就错了。对于得到，我们都应该充满感激，对于失去，谁能保证那本该是属于你的？有些东西原本就是让你牵挂，而不是获取的。难忘的人会忘，做过的梦成真，期待过去实现，走过的路让自己强壮，珍惜因果，顺乎自然。
过去的一页，能不翻就不要翻，翻落了灰尘会迷了双眼。有些人说不出哪里好，但就是谁都替代不了！那些以前说着永不分离的人，早已经散落在天涯了。收拾起心情，继续走吧，错过花，你将收获雨，错过这一个，你才会遇到下一个。
当一个人最看重的东西是面子，那他为此失去的一定很多。
人可以拒绝任何东西，但绝对不可以拒绝成熟。拒绝成熟，实际上就是在规避问题、逃避痛苦。规避问题和逃避痛苦的趋向，是人类心理疾病的根源，不及时处理，你就会为此付出沉重的代价，承受更大的痛苦。
能耐得住寂寞的人，肯定是有思想的人；能忍受孤独的人，肯定是有理想的人；遇事能屈能伸的人，肯定是有胸怀的人；处事从容不迫的人，肯定是个淡定的人；经常微笑的人，肯定是有头脑的人；看透天下事的人，肯定是个有智慧的人。
如果，年华不曾老去，我不愿以清绝的姿态，总以忧伤示人，每当狂欢响起，而我总会念着谢幕，念着残缺。如果，年华不曾老去，我不愿再坐等年轮一圈圈卷起，不会让友情与爱情，以沧桑的名义在身旁悄悄地溜走，而是耗尽此生时光，用最温暖的文字为爱写歌，为情谱曲。
不论什么时候开始，重要的是开始之后就不要停止。不论什么时候结束，重要的是结束之后就不要悔恨。
无缘何生斯世，有情能累此生。
知音，能有一个已经很好了，不必太多。如果实在没有，还有自己。好好对待自己，跟自己相处，也是一个朋友。
世界上有两个我，一个假装快乐，一个真心难过。
真正的自信不是表现给别人看的，而是无意当中散发出来的。自信来自于哪里，对于我来说，自信来自于自己对于工作的把握，对于生活的把握。当自己面对不同的人，不同的环境的时候，我知道不需要担心自己。——闾丘露薇
我们来到这个世上，每个人都背着一个空篓子，而人的一生，就是不断地往自己的篓子里放东西的过程。如果有了，就想更多，贪得无厌，欲壑难填。只做加法的人生是很悲哀的，远离名利，看淡成败，安于淡泊就是做减法。减去多余的物质，减去奢侈的欲望，减去心灵的负担。加减法并用，人生之旅才会风光无限。
一辈子那么长，一天没走到终点，你就一天不知道哪一个才是陪你走到最后的人。有时你遇到了一个人，以为就是他了，后来回头看，其实他也不过是这一段路给了你想要的东西。
走到生命的哪一个阶段，都该喜欢那一段时光，完成那一阶段该完成的职责，顺生而行，不沉迷过去，不狂热地期待着未来，生命这样就好。不管正经历着怎样的挣扎与挑战，或许我们都只有一个选择：虽然痛苦，却依然要快乐，并相信未来。
谦和、温顺且自持的生活，不乱于心，不困于情，不畏将来，不念过去。
我要的，不是短暂的温柔，而是一生的守候。
当爱一个人，却无法拥有他时，自己面对着一个选择：放弃还是继续。包括你在内的很多人都说：放弃吧，不要再浪费青春。但是，自己却明白，自己真的放不下。如果能放下，早都已经放下了，根本不会到现在的地步。所以，当黑夜来临的时候，我只能孤独的思念一个人。
茫茫人海，没有人不喜欢幸福的，没有人不期待幸福的，没有人不向往幸福的。但不同的时代有着不同的理解，不同的阶层有着不同的看法，不同的年龄有着不同的要求。无论怎么不同，有一点却是相同的，那就是幸福降临的时候，会感到比美妙更美妙，比快乐更快乐，总会激动不已甚至泪流满面。
请把你的心给我，与我为伍，这个世界太残酷了，我有些害怕。
没有一百分的另一半，只有五十分的两个人。
命中有很多事情足以把你打倒，但真正能把你打倒的是你的心态。
你喜欢的人也喜欢你，你想念的人也正在想念你。这就是全世界最重要的事情，拿什么都不能换。
最好的年龄是，那一天，你终于知道并且坚信自己有多好，不是虚张，不是夸浮，不是众人捧，是内心明明澈澈知道：是的，我就是这么好。
妈妈说只要我乖乖认错，就会再拉住我的手；你说不是有的时候认错，就能够让我们再次牵手。亲人总会原谅，因为你是他们的孩子；爱人总难原谅，因为我们都是孩子。
分手之后，不用觉得那些曾经的恩爱是耳光，不用觉得那些说过的誓言多苍白，也不用去喊什么低调的幸福才能长久，至少在当时当地，它们都是出自真心。这所有的东西，都值得珍藏，你的青春没有白费。
刚好处在这个尴尬的年龄，开始关心爸妈，却不愿说出口；想多陪陪爸妈，却更贪恋坐在电脑前；知道爸妈想和自己说话，却不知道他们的话题要怎么接；看得到爸妈在变老，却仍不耐烦他们的过时。心里时时刻刻在愧疚，却依然带给他们落寞。
她没有见过阴云，她的眼睛是晴空的颜色。她永远看着我，永远，看着，绝不会忽然掉过头去。
不论是自转还是公转，涨潮还是退潮；不论是暖流改变气温带来鱼群，或者海水淹没岛屿失去踪迹；不论是我的世界车水马龙繁华盛世，还是它们都瞬间消失化为须臾；我都会坚定地走向你，不迷惑，不慌张，不犹豫。
谁都以为自己会是例外——在后悔之外。谁都以为拥有的感情也是例外——在变淡之外。谁都以为恋爱的对象刚巧也是例外——在改变之外。然而最终发现——除了变化，无一例外。
星云大师：口袋没钱，心里没钱，轻松一辈子；口袋有钱，心里有钱，劳累一辈子；口袋没钱，心里有钱，痛苦一辈子；口袋有钱，心里没钱，快乐一辈子。
人生是一种选择，亦是一种放弃。能自由选择的人是幸福的，能适度放弃的心是洒脱的。可惜，有时我们的选择，只有等待，没有结果，只能黯然离开；有时我们的放弃，迫于无奈，含泪转身，走远了依旧频频地回望。
不知不觉，是这世上最可怕的力量。
温暖在你心里，只是你自己还没有发现它。
当我们感到幸福的时候，何必去想这幸福是永恒的，还是暂时的。忧虑，是幸福最大的敌人。
给自己的三句话：一、年轻，什么都还来得及；二、不要纠缠于小事；三、你现在遇到的事都是小事。
执子之手，共度此生——曾经以为所有的爱情都一定要惊天动地；曾经以为每个人的爱情都一定要轰轰烈烈；曾经以为所有的爱情都有花前月下，海誓山盟；曾经无限向往九千九百九十九朵玫瑰的浪漫……然而平平淡淡同样震撼人心，执手之时，冷暖两心知；执手之时，悲喜两忘。
恐惧就是这样一个懦夫，当你触及他的底线，接受事情最坏的结果，然后开始准备和它大干一场的时候，它早就不知道躲到哪里去了。
爱情不是学问，不用学习，若果爱一个人，发自内心，难以遮掩，自然而然以他为重，这是种本能，不费吹灰之力。
曾经，你苦苦以为，没有了这个人，也就活不成了，到了后来，不是活得好好的吗？一个不爱你的人，决不会比你的生命重要；一个爱你的人，会告诉你，你的生命比你对他的爱情重要。
“归属感”是你强烈地想和他在一起，“安全感”是你觉得他强烈地想和你在一起。
人生总要经历很多，有些人无法羽化成铭记，有些事无法沉淀为回忆。对于一些伤痛的人与事，要学会走过了就要淡漠，转身了就要遗忘，唯有如此，我们的行囊才不会太沉重，我们的身心才不会太疲乏。相聚是短暂的，分别会是永远的，没有人能是你永恒的挂牵，任何事都不要成为你所有的渴盼。
人的一生很像是在雾中行走；远远望去，只是迷蒙一片，辨不出方向和吉凶。可是，当你鼓起勇气，放下忧惧和怀疑，一步一步向前走去的时候，你就会发现，每走一步，你都能把下一步路看得清楚一点。“往前走，别站在远远的地方观望！”你就可以找到你的方向。
爱就是，无论你怎么抵挡，它还是要来的东西。爱就是，无论你怎么诋毁，它还是高尚的东西。
洒脱是人生的一种境界。洒脱不是无所事事、不思进取，也不是看破红尘、心灰意冷，更不是声色犬马、纸醉金迷。洒脱是一种世事洞明的豁达，一种淡泊名利的超脱，一种有所为有所不为的风度。洒脱不是放弃，而是放下，放下不切实际的幻想，放下无法更改的过去，行云流水，任其所之。
每棵大树，都曾只是一粒种子。
人累了，就休息；心累了，就淡定。长大了，成熟了，这个社会就看透了。累了，难过了，就蹲下来，给自己一个拥抱。因为这个世界上没有人能同情你，怜悯你。你哭了，眼泪是自己的；你痛了，没有人能体会到。你一定要坚强，即使受过伤，流过泪，也能咬牙走下去。因为，人生，其实只是你一个人的人生。
和错误的人在一起，就好比穿了双不合脚的鞋，即使鞋子再美，最终伤到的还是自己。
每天告诉自己：再难也要坚持，再好也要淡泊，再差也要自信，再多也要节省，再冷也要热情。
人心总有压抑的时候，爱情也是很沉重的一回事。但是，可以想想父母兄弟，夜里抬头看看星月。上帝造这世界，并非叫每个人只为爱情活着。为太阳月亮又有何不可，吸两口空气，低潮就过去了。三十年后，想起为爱情萌生死念，会觉得可笑。——亦舒
人生，都有“艰难”这个副产品，却也有时间这副良药，将不幸变成有幸，是生活给我们最好的礼物。
这世界上没有未完成的故事，只有未死的心。在两个人的情感对弈中，最后动心的未必是赢家；而最后死心的，则必定是输家。
别人站得远，我们就走近，距离便会缩小；别人若冷漠，我们待以热情，就会逐渐热络。惟有主动付出，才有丰富的果实获得收获。用微笑面对人生，也要面对自己的悲伤与痛苦，我们能面对悲伤，就是因为心中有信念。没有什么事难得到自己的，坚信光芒，铭记于心。
我们都不会轻易的活在这个世界上，要知道，我们能来到这个世上是多大的一个奇迹。
别人的男友再好，不过是奢侈品，自己的男友再差，却是必需品。不是非常之爱，没人甘愿做替代品。不是非常之恋，没人甘心当必需品。奢侈品是一种奢望，必需品是一种必须，在奢侈品与必需品之间，最缺的就是一颗平常心。
别让自己活得太累。应该学着想开、看淡，学着不强求，学着深藏。适时放松自己，寻找宣泄，给疲惫的心灵解解压。人之所以会烦恼，就是记性太好，记住了那些不该记住的东西。所以，记住快乐的事，忘记令你悲伤的事。
不论你生活在何处，和爱遇见了，就打个招呼；相逢了，就给个拥抱；分手了，就说句再见。不纠缠，不厌世，不对爱情恶言相向。
我们因彼此懂得而惺惺相惜；我们因惺惺相惜而心念相应；我们因心念相应而无视距离。我们不能没有期望，没有梦想，没有依托；我们也不能没有朋友，没有理解，没有认同，总是一个人走过漫漫的人生苦旅。不管我们相隔多远，我们都能感到彼此的每一次心跳，我们用心和微笑把彼此的距离拉到最近
小的时候，每个孩子都会给父母许下诺言：长大了，我要带你们如何如何……渐渐长大了，渐渐离父母越来越远，渐渐忙得喘不过气了……忽然有一日，恍过神来，发现父母已是满头银发。他们的腰被岁月压弯了；他们脚步蹒跚，再也不能随你去看山望水；他们甚至失去记忆，再也听不清你说的那些甜言蜜语……
有时候你必须跳出“窗外”，然后在坠落的过程中长出“翅膀”。
宝贝，请记住：你必须坚强，没有人会懂得你到底有多痛。你必须坚强，没有人会懂你到底要怎么继续生活下去。你必须坚强，没有人知道你经历了怎么样的生活。你必须坚强，没有人知道你微笑背后所隐藏的伤痛。你必须坚强，没有人知道你在想哭的时候却发现原来早已没有了眼泪。你若不坚强，谁替你勇敢。
一个人久了，对爱情会越挑剔；一个人久了，会变的比恋爱时候成熟；一个人久了，朋友会越重要；一个人久了，会越来越喜欢听歌；一个人久了，对节日大多没啥期待。一个人久了，因为怕伤害，懒得去恋爱，懒得去了解人。
真心怀念高中了。每天穿着校服到处乱蹭。男生上课用手机看文字直播的NBA。下课走廊里闹哄哄的。厕所也要排队。最恨老师抱着卷子进班。有总是第一的书呆子也有隐藏在最后一排的神吐槽的大神。我也怀念那时候的我。因为一切都看起来那么有希望。好像只要努力，什么都能改变
生命本是一次旅行，在每一次停泊时都要清理自己的口袋，把更多的位置空出来，让自己活得更轻松、更自在。心无杂物，才会有满心室的暖暖阳光，才会有从容生活轻松涉世的自信和勇气。只有拥有一颗空灵的心，才能注入快乐，注入幸福。
现在要一份纯粹的爱情，很难。放不下骄傲，放不下身段，参杂太多人太多事，彼此撑着，最后以“爱不起”、“不适合”收场。陪我们走到最后的人，也许算不上是我们最爱的，但会是最合适的。这样也很好，不是吗？人生本不完美，也许懂得知足。年轻就是这样，有错过有遗憾，最后才会学着珍惜
爱情里最忌讳的就是：两人都幻想着彼此的未来，却也总惦记着对方的过去。
伤心最大的建设性，在于明白，那颗心还在老地方。
深的话要浅浅地说，长长的路要挥霍地走。大大的世界要率真地感受，会痛的伤口要轻轻地揉。
《老男孩》和《那些年我们一起追过的女孩》告诉我们一个事实：也许现在你们很相爱，但是如果你们现在不努力的话，到最后陪她结婚的人一定不是你！现实并不残酷，残酷的是你自己对青春的挥霍！以后的结果都是由你自己制造的，爱一个人不是每天的甜言蜜语，而是每天的发奋图强！
有时候，你难免多心。心眼一多，许多小事就跟着过敏，于是别人多看你一眼，你便觉得他对你有敌意；少看你一眼，你又认定他故意对你冷落。多心的人注定活得辛苦，因为太容易被别人的情绪所左右。多心的人总是胡思乱想，结果是困在一团乱麻般的思绪中，动弹不得。有时候，与其多心，不如少根筋。
第一次的爱，始终无法轻描淡写。我对你，只有放弃，没有忘记。站在心碎的地方，轻轻打一个结，一种缝补，阻止伤痛再流出。在这个城市，做一道路过的风景，做一次匆匆的过客，只为了一个人。也许有一天，你回头了，而我却早已，不在那个路口。
即使不见面，不说话，不发信息，我也会在心里留一个位置，安安稳稳的放着一个人。
我相信，爱可以排除万难。只是，万难之后，又有万难，这是我更相信的。
男生没有主动找女生，那是说明他是真的不想理她了。女生没有主动找男生，是因为在等他找她。
当一个人不爱你要离开你时，你要问自己还爱不爱他，千万别为了可怜的自尊而不肯离开。等到天放晴的时候，你就会遇到一个能让你好好再爱一次的人。
不要相信日韩肥皂剧中所谓的因为不能让彼此幸福而离开。是否想过，你们正是对方的幸福。爱不是逃避，是努力。不是逃避着给彼此幸福的责任，而是努力的实现让彼此幸福的义务。当你说离开是为了不让对方受到伤害的时候，你已经给对方造成了最大的伤害。爱就是要努力在一起。
有时候，你爱上的那个人，是会完全打破你一直以来的标准。从世俗的眼光看来，他也许不是那么标准；然而，乍然相逢的一刻，他翩翩的身影却在你眼里开出了翻翻腾腾的花。突然之间，世间的标准都可以抛弃，他凌驾了一切的标准。
不要因为害怕彼此离开而体谅。体谅是因为爱，而不是因为恐惧。爱是一种责任，不可以轻易的离开。让你为离开而恐惧的人，算不上爱人，就算付出再多，要离开的人，终究是会离开。
忘了有多久，习惯对朋友说都好都好，却对陌生人坦白自己的心事。
人生就像一杯没有加糖的咖啡，喝起来是苦涩的，回味起来却有久久不会退去的余香；人生就是一场旅行，不在乎目的地，在乎的是沿途的风景以及看风景的心情；人生就是一条坎坷曲折的路，即使不断的跌倒，也一定要爬起来，坚持自己的梦想。记住，这一秒不放弃，下一秒就会有希望。
一句我等你，不知道需要多大的勇气。它远比我爱你三个字，更需要勇气。不是每个人你都愿意等待，也不是所有人都值得你去等待。一句我等你，包含了很多的无奈，心酸，苦涩。或许是爱不到，或许是不能爱，无论怎样，我等你这个承诺，远比我爱你更动听。可是，有多少的爱情经得起等待？
做一个安静细微的人，于角落里自在开放，默默悦人，却始终不引起过分热闹的关注，保有独立而随意的品格，这就很好。
过去的事，不后悔；将来的事，不害怕。对于那些应经发生的事，要坦然接受，无论它对你产生的不利影响有多大，它都已经发生了。人生是一场一个人的旅程，无人可替代。总有人离开，总有人到来。
EOF;
	$contents=explode("\n", $text);
	$content=$contents[array_rand($contents)];
	return $content;
}

function get_random_tid($tieba){
	$ch = curl_init ('http://tieba.baidu.com/f?kw='.urlencode(iconv('utf-8', 'gbk', $tieba)).'&fr=index');
	curl_setopt ( $ch, CURLOPT_RETURNTRANSFER, 1 );
	$contents = curl_exec ( $ch );
	curl_close ( $ch );
	preg_match_all('/<li class="j_thread_list[A-z0-9 -_]+" data-field=\'{(?<json>.*?)}\'/', $contents, $jsontids);
	foreach ($jsontids['json'] as $jsontid){
		$jsontid=str_replace('&quot;','"', '{'.$jsontid.'}');
		$tids[]=json_decode($jsontid)->id;
	}
	$tid=$tids[rand(0,count($tids)-1)];
	return $tid;
}

function client_rppost($uid, $tieba, $content) {
	$cookie = get_cookie ( $uid );
	preg_match ( '/BDUSS=([^ ;]+);/i', $cookie, $matches );
	$BDUSS = trim ( $matches [1] );
	$setting = DB::fetch_first ( "SELECT * FROM xxx_post_setting WHERE uid='{$uid}'" );
	if ($setting ['client_type'] == 5)
		$setting ['client_type'] = rand ( 1, 4 );
	if (! $BDUSS) return array (- 1,'找不到 BDUSS Cookie' );
	if (! $content) $content=get_random_content();
	if (! $tieba['tid']) $tieba['tid']=get_random_tid($tieba ['name']);
	$formdata = array (
			'BDUSS' => $BDUSS,
			'_client_id' => 'wappc_136' . random ( 10, true ) . '_' . random ( 3, true ),
			'_client_type' => $setting ['client_type'],
			'_client_version' => '5.0.0',
			'_phone_imei' => md5 ( random ( 16 ) ),
			'anonymous' => 0,
			'content' => $content,
			'fid' => $tieba ['fid'],
			'kw' => urldecode ( $tieba ['name'] ),
			'net_type' => 3,
			'tbs' => get_tbs ( $tieba ['uid'] ),
			'tid' => $tieba ['tid'],
			'title' => ""
	);
	$adddata = '';
	foreach ( $formdata as $k => $v )
		$adddata .= $k . '=' . $v;
	$sign = strtoupper ( md5 ( $adddata . 'tiebaclient!!!' ) );
	$formdata ['sign'] = $sign;
	$ch = curl_init ( 'http://c.tieba.baidu.com/c/c/post/add' );
	curl_setopt ( $ch, CURLOPT_HTTPHEADER, array (
			'Content-Type: application/x-www-form-urlencoded'
	) );
	curl_setopt ( $ch, CURLOPT_RETURNTRANSFER, true );
	curl_setopt ( $ch, CURLOPT_COOKIE, $cookie );
	curl_setopt ( $ch, CURLOPT_POST, true );
	curl_setopt ( $ch, CURLOPT_POSTFIELDS, http_build_query ( $formdata ) );
	$re = @json_decode ( curl_exec ( $ch ), ture );
	curl_close ( $ch );
	switch ($setting ['client_type']) {
		case '1' :
			$client_res = "iphone";
			break;
		case '2' :
			$client_res = "android";
			break;
		case '3' :
			$client_res = "WindowsPhone";
			break;
		case '4' :
			$client_res = "Windows8";
			break;
	}
	if (!$re) return array (0,'JSON 解析错误' );
	if ($re ['error_code'] == 0) return array (2,"使用" . $client_res . '客户端发帖成功，<a href="http://tieba.baidu.com/p/' . $tieba ['tid'] . '" target="_blank">查看帖子</a>');
	else if ($re ['error_code'] == 5) return array (5,"需要输入验证码，请检查你是否已经关注该贴吧。" 	);
	else if ($re ['error_code'] == 7) return array (7,"您的操作太频繁了！" );
	else if ($re ['error_code'] == 8) return array (8,"您已经被封禁" );
	else return array($re ['error_code'],"未知错误，错误代码：" . $re ['error_code']);
}

?>